{
  "all_patch_size": [
    2
  ],
  "all_f_patch_size": [
    1
  ],
  "in_channels": 16,
  "dim": 3840,
  "n_layers": 30,
  "n_refiner_layers": 2,
  "n_heads": 30,
  "n_kv_heads": 30,
  "norm_eps": 1e-05,
  "qk_norm": true,
  "cap_feat_dim": 2560,
  "rope_theta": 256.0,
  "t_scale": 1000.0,
  "axes_dims": [
    32,
    48,
    48
  ],
  "axes_lens": [
    1536,
    512,
    512
  ],
  "_class_name": "ZImageTransformer2DModel",
  "_diffusers_version": "0.36.0.dev0",
  "_name_or_path": "/root/.cache/huggingface/hub/models--Tongyi-MAI--Z-Image-Turbo/snapshots/f332072aa78be7aecdf3ee76d5c247082da564a6/transformer"
}